# Задача № 1

'''print('---------- "Мини-викторины" с вопросами и вариантами ответов, проверкой правильности и выводом результата. ----------')
print()

# Инициализируем счетчики правильных и неправильных ответов
correct_answers = 0
incorrect_answers = 0

print('Химический знак водорода это? \n a)O \n b)C \n d)H \n b)S')
question_1 = input('Введите ответ только символами: ')

if question_1 == 'd':
    print('Ответ верный.')
    correct_answers += 1
else:
    print('К сожалению не верно.')
    incorrect_answers += 1

print()

print('Круто идем дальше) ')

print('У кальция атомная масса? \n a)40 \n b)20 \n d)35 \n b)65')
question_2 = input('Введите ответ только символами: ')

if question_2 == 'a':
    print('Ответ верный.')
    correct_answers += 1
else:
    print('К сожалению не верно.')
    incorrect_answers += 1
print()

print('Круто идем дальше) ')

print('У кислорода на последнем энергетическом уровне? \n a)2 электрона \n b)6 электронов \n d)5 электронов \n b)4 электрона')
question_3 = input('Введите ответ только символами: ')

if question_3 == 'b':
    print('Ответ верный.')
    correct_answers += 1
else:
    print('К сожалению не верно.')
    incorrect_answers += 1
print()

print('Викторина закончилась. Неправильных ответов:', incorrect_answers)
print('Правильных ответов:', correct_answers)

# Выводим правильные ответы
print('Правильные ответы:')
print('1. Химический знак водорода это d)H')
print('2. У кальция атомная масса a)40')
print('3. У кислорода на последнем энергетическом уровне b)6 электронов')'''

# Задания № 2
''' Создание программы для определения допустимости входа на сайт с использованием введенных данных. '''

'''expected_password = "along123"


password = input("Введите пароль: ")


if password == expected_password:
    print("Доступ открыт")
else:
    print("Неправильный пароль")'''
    
# Задания № 3

''' Создание простого калькулятора для расчета стоимости доставки на основе веса и расстояния. '''

'''weight = float(input("Введите вес груза (в килограммах): "))
distance = float(input("Введите расстояние (в километрах): "))

if weight <= 10:
    if distance <= 100:
        print("Стоимость доставки: $5")
    else:
        print("Стоимость доставки: $7")
else:
    if distance <= 100:
        print("Стоимость доставки: $8")
    else:
        print("Стоимость доставки: $10")'''



