# Задания № 1
''' Напишите программу, 
которая принимает от пользователя оценку (число от 1 до 5) 
и выводит описание этой оценки 
("Отлично", "Хорошо","Удовлетворительно","Неудовлетворительно").'''

'''user_print_grade = int(input('Введите вашу оценку: '))

if user_print_grade == 2:
    print('Ваша оценка Неудовлетворительная) ')
elif user_print_grade == 3:
    print('Ваша оценка Удовлетворительная)')
elif user_print_grade == 4:
    print('Ваша оценка Хорошая)')
elif user_print_grade == 5:
    print('Ваша оценка Отличная)')'''

# Задания № 2
''' Программе дается с клавиатуры число - возраст человека.
Необходимо вывести к какой категории граждан он относится:
"Младенец", если возраст меньше 2х лет;
"Ребенок", если возраст от 2 лет, но меньше 12;
"Подросток", когда возраст от 12 лет, но меньше 18;
"Молодёжь", когда возраст от 18 лет, но меньше 35;
"Взрослый человек", когда возраст от 35 лет, но меньше 60;
"Пожилой человек", если возраст 60 лет и более.'''

'''user_number = int(input('Введите пожалуйста ваш возраст: '))

if user_number < 2:
    print('Вы являетесь к категории "Младенец"')
elif user_number < 12:
    print('Вы являетесь к категории "Ребенок"')
elif user_number < 18:
    print('Вы являетесь к категории "Подросток"')
elif user_number < 35:
    print('Вы являетесь к категории "Молодёжь"')
elif user_number < 60:
    print('Вы являетесь к категории "Взрослый человек"')
elif user_number >= 60:
    print('Вы являетесь к категории "Пожилой человек"')'''

