# Задания № 1

""" Напишите программу, которая запрашивает у пользователя число и проверяет, 
является ли оно четным или нечетным. Если число четное, программа должна проверить, 
делится ли оно также на 4. Выведите соответствующее сообщение. """

"""user_number = int(input('Введите любое число: '))

if user_number % 2 == 0:
    print('Число четное.')
else:
    print('Число нечетное.')"""
    
# Задания № 2

""" Напишите программу, 
которая запрашивает у пользователя оценку (число от 1 до 10) и выводит сообщение о том, 
какую оценку он получил: "Отлично","Хорошо","Удовлетворительно","Неудовлетворительно". Если оценка
ниже 4, программа должна спросить, есть ли у ученика дополнительная работа. """

"""user_number_count = int(input('Введите оценку (число от 1 до 10): '))

if user_number_count >= 9:
    print("Отлично")
elif user_number_count >= 7:
    print("Хорошо")
elif user_number_count >= 4:
    print("Удовлетворительно")
else:
    print("Неудовлетворительно")
    
if user_number_count < 4:
        response = input("Есть ли у вас дополнительная работа? (да/нет): ")
        if response.lower() == "да":
            print("Пожалуйста, выполните дополнительное задание.")
        else:
            print("Успехов в следующий раз!") """ 
    
    
