# Задания № 1
'''Напишите программу,
 которая принимает от пользователя два числа и выводит сообщение о том, 
 какое из чисел больше.'''

'''user_number_one = int(input('Введите первое любое число: '))
user_number_two = int(input('Введите второе любое число: '))

if user_number_one > user_number_two :
    print('Первое число больше второго)')
elif user_number_one == user_number_two :
    print('Они равны ')
else:
    print('Второе число больше первого)')'''

# Задания № 2 

"""Напишите программу, которая проверяет, 
лежит ли введенное пользователем число в диапазоне от 10 до 20 включительно, 
и выводит соответствующее сообщение."""

'''user_number = int(input('Введите любое число: '))

if user_number >= 10 and user_number <= 20:
    print('Пользователь ввел число которое поподает в диапазон от 10 до 20: ')
else:
    print('Пользоатель ввел число которое в диапазон не попадает) ')'''

# Задания № 3

'''Напишите программу, 
которая принимает от пользователя возраст и выводит сообщение о том, 
может ли он водить автомобиль (18 лет и старше) или нет.'''


'''user_number_age = int(input('Введите пожалуйста ваш возраст: '))

if user_number_age  >= 18:
    print('Вы уже можете водить автомобиль )')
else:
    print('Извините но ваш возраст не позволяет водить автомобиль )')'''