# Задания № 1

""" Напишите программу, которая принимает от пользователя оценку (число от 1 до 5) 
и выводит описание этой оценки в текстовом виде, 
используя оператор if-elif-else. """

'''user_number_count = int(input('Введите вашу оценку от 1 до 5: '))

if user_number_count <= 2:
    print('Неудовлетворительно')
elif user_number_count == 3:
    print('Удовлетворительно')
elif user_number_count == 4:
     print('Хорошо')
else:
    print('Отлично')'''
    
# Задания № 2

''' Напишите программу, которая проверяет, 
в какой четверти находится введенное пользователем число (1-4), 
и выводит соответствующее сообщение. '''

'''user_number = int(input('Введите вашу оценку от 1 до 4: '))

if user_number == 1:
    print('Число находится в 1-й четверти. ')
elif user_number == 2:
    print('Число находится в 2-й четверти. ')
elif user_number == 3:
    print('Число находится в 3-й четверти. ')
else:
    print('Число находится в 4-й четверти. ')'''
